;ティラノスクリプトサンプルゲーム

*start

[cm  ]
[clearfix]
[start_keyconfig]


[bg storage="room.jpg" time="100"]

;メニューボタンの表示
@showmenubutton

;メッセージウィンドウの設定
[position layer="message0" left=160 top=500 width=1000 height=200 page=fore visible=true]

;文字が表示される領域を調整
[position layer=message0 page=fore margint="45" marginl="50" marginr="70" marginb="60"]


;メッセージウィンドウの表示
@layopt layer=message0 visible=true

;キャラクターの名前が表示される文字領域
[ptext name="chara_name_area" layer="message0" color="white" size=28 bold=true x=180 y=510]

;上記で定義した領域がキャラクターの名前表示であることを宣言（これがないと#の部分でエラーになります）
[chara_config ptext="chara_name_area"]

;このゲームで登場するキャラクターを宣言
;akane
[chara_new  name="akane" storage="chara/akane/normal.png" jname="あかね"  ]
;キャラクターの表情登録
[chara_face name="akane" face="angry" storage="chara/akane/angry.png"]
[chara_face name="akane" face="doki" storage="chara/akane/doki.png"]
[chara_face name="akane" face="happy" storage="chara/akane/happy.png"]
[chara_face name="akane" face="sad" storage="chara/akane/sad.png"]

;hiroin_すてあ

;sub_みやの

;教室
[label name="s1-classroom"]
;[button text="s2-図書館" target="s2-library"]
[skipstart]

#
俺はore。ごく普通の男子高校生だ。[p]
成績も普通。スポーツも普通。他の人と比べて特に目立つようなところはない。[r][p]
ある一点を除いて……。[r]それは……。[p]

#？？？
お～い？[r]oreく～ん？[p]

#
？[p]

;廊下に向く
#？？？
どうも～[r]
元気～？[p]

#
やあ、subちゃん。俺は元気だよ。[r][p]
あれ？今日はhiroinは学校に来てないの？[p]

#sub
あ～それがね～。[p]

;hiroinが下から勢いよく登場
#hiroin
[font size="60"]わっ！！！！[p][resetfont]

#
おわ！？！？！？！？

[quake time=300 vmax=0 hmax=10 count=4]

[p]

#hiroin
えへへ～[r][p]
びっくりした～？[p]

#
そりゃいきなり現れたらびっくりするよ……。[p]

#sub
ごめんねー。hiroinちゃんに頼まれてore君を驚かす手伝いをしてほしいって言われてさ～[p]

#hiroin
え～subちゃんもノリノリだったじゃ～ん。[p]

#
くっそ……[p]
(ご覧の通り俺は超絶のビビりなのである。)[r][p]
(しかも、幼馴染のhiroinは俺がビビりなことをからかって毎日驚かしに来るのである。)[p]
(おかげで驚かされる度にクラスメイトから注目されてしまう……。)[p]

#
いつも驚かせに来るけど、そろそろやめてくれない……？[r][p]

#hiroin
えー？やめてって言われても、oreの反応が面白いもーん。[p]
絶対やめな～い。[p]

#sub
あはは……。[r]それじゃあ私は委員会の仕事があるからまた明日ね。[p]

#hiroin
バイバイsubちゃん！[p]

#
バイバイ。[p]

#hiroin
ore君はこの後どうする？[r]このまま部室に来る？[p]

#
いや、図書館に本を返しに行ってから部活に行こうかな。[p]

#hiroin
そう？じゃあ私も付いていこうかな。[p]

#
じゃあ図書館に行くか。[p]

[skipstop]

;----scene1終了-----
;図書館へシーン遷移
[label name="s2-library"]


#hiroin
そういえば何の本を借りてたの？[p]

#
気になった小説とかかな。[p]
付いてきたのはいいけど、図書館だから流石に静かにしろよ。[p]

#hiroin
そんぐらい分かってるよぅ～[l][r]
5分で戻ってきてー。[p]

#
すぐ終わらせるから待ってろ。[p]

#hiroin
はーい。[p]

#
(絶対驚かしに来るんだろうな……)[p]

;図書館内に移動
#
借りてた本を返す前に次に借りる本を探すか。[p]
どの本を借りようかな……[l][r][r]

;本を選ぶイベント発生 今週のおすすめの本のコーナーにて
;話題の人気小説1,2(どっちかがsubのおすすめ)・推理系・エッセイ・難しそうな本・謎の本
;時間制限でhiroinが驚かしに来るイベントを作ろうかな

[link target=*select1]新着のエッセイ[endlink][r]
[link target=*select2]話題の人気小説[endlink][r]
[link target=*select3]気になる推理小説[endlink][r]
[link target=*select4]哲学の学術本[endlink][r]
[s]

*select1
[cm]
[eval exp="sf.book = 1"]
新着のエッセイを選んだ[l]
@jump target=*common

*select2
[cm]
[eval exp="sf.book = 2"]
話題の人気小説を選んだ[l]
@jump target=*common

*select3
[cm]
[eval exp="sf.book = 3"]
気になる推理小説を選んだ[l]
@jump target=*common

*select4
[cm]
[eval exp="sf.book = 4"]
哲学の学術本を選んだ[l]
@jump target=*common

*common
[cm]

;選択後
この本にするか。[p]

;受付前に移動
#sub
あっore君。今日も本を借りに来たの？[p]

#
そうだよ。先に前に借りた本を返してからだけどね。[p]

#sub
じゃあ返却ってことだねー。[r][l]
こ・れ・で・よし。[l] ;テキストスピードを落とす
返却できたよー。[p]

#
ありがとう。[r]
じゃあこれが借りる本ね[p]


;新着のエッセイ
[if exp="sf.book==1"]
#sub
さんきゅー。[l]
あっこの本って新着コーナーにあったやつ？[p]

#
そう。ちょっと前にニュースになってたから見たくなっちゃったんだ。[p]

#sub
へー。私も気になるから今度感想聞かせてねー。[p]

#
わかった。部活行ってるね。[p]

#sub
バイバーイ。また明日ー。[p]
[endif]

;話題の人気小説
[if exp="sf.book==2"]
#sub
さんきゅー。[l]
おっこの本ってクラスで話題になってた本じゃん。[p]

#
そうそう。たまたま見つけたから読んでみたくなって。[p]

#sub
あのね。今その本かなり人気で[l]
返されたらその日に借りられちゃんだよ？[p]

#
えっ？じゃあめっちゃラッキーじゃん！[p]

#sub
そう。まだ借りようとしてる人はけっこう居ると思うから[r]
なる早で返してね。[p]

#
そ、そうするよ……。[p]
じゃあ部活に行くよ。バイバイ。[p]

#sub
じゃあねー。[p]
[endif]

;気になる推理小説
[if exp="sf.book==3"]
#sub
さんきゅー。[l]
ってこれ私のおすすめの本じゃん！[p]

#
えっこの本ってsubちゃんがおすすめしてた本だったの？[p]

#sub
そーだよ。[r]
君もこの本気になったの？[p]

#
うん、そう。この作者さんの推理小説が好きで何回も読み直したりもしてるんだ。[p]

#sub
えっ！そうなの？私もだよ！[p]
私と君ってけっこう趣味合うんだねー。[p]
かなりいい本だから、返すときに感想聞かせてね。[p]

#
分かったよ。じゃあ部活行ってくる。[p]

#sub
部活がんばってねー。[p]
[endif]

;哲学の学術本
[if exp="sf.book==4"]


;廊下
#hiroin
ちょっとー遅いよー[r][l]
ケッコー待ってたんだけど～。[p]

#
ごめん。ちょっと借りる本に迷っちゃって。[p]

#hiroin
すぐ部活に行こう！[l][r]
部室まで競争だ！！[p]

#
あっ！ちょっとスタートダッシュずるい！[p]

;場面変更
;----シーン２終了----
[label name="s3-club"]

;昇降口

#
はぁはぁ……。[l][r]
本をカバンにしまってたら完全に置いてかれてしまった……。[p]

;ダッシュをするミニゲームでもいい

#hiroin ;横から登場
[font size="60"]わっ！！！！[p][resetfont]

#
うぇっっっっっ！？！？！？[p]

#hiroin
あはははははっあはははっはっ[r]
やっぱりoreの反応おもしろい～～～。[p]

#
このやろぉ……。[r]
俺をダッシュで置いていったのは驚かすためだったのか……。[p]

#hiroin
ほんとーはそんな気はなかったたんだけど、思いついちゃったんだよね～。[p]

#
こいつ……。[p]

#hiroin
ちなみにレースはまだ終わってないよ～。[p]
;hiorinがダッシュで逃げる

#
あっ！ちょっと待て！！[p]

;弓道場に移動、弓道着に着替えて登場
#hiroin
わたしの勝ち～。[l][r]
ore君、遅かったね～。[p]

#
お前が「驚かす」っていう卑怯な手を使ってくるからだろ……。[p]

#hiroin
途中で物陰から現れただけだし～。[p]

#
それが「驚かす」っていうんだろ……。[r][l]
とにかく今回のレースに関してはノーカンでしょ！[p]

#hiroin
え～～～[r][l]
じゃあ的中率で勝負しようよ！！[p]
わたし、今日の朝練ですっごく調子よかったんだよね～。[p]

#
的中率の勝負なら望むところだ！[r]
卑怯な手は絶対使うなよ？[p]

#hiroin
負けたほうがコンビニでアイスおごるってことで良いよね！[p]
真剣勝負だ！！[r]
絶対負けないからね！！[p]

;----一時暗転----
#hiroin
3発！3発も当たったよ！！[r][l]

#
見てたから知ってるよ……。[p]

#hiroin
メチャクチャ上手くいったよ！[r][l]
これで君は全部的中させなきゃ勝てないね～。(ニヤニヤ)[p]

#
これはかなり勝つのが厳しいな……。[p]
全部当ててやるからな！[l]見とけよ！！[p]

#hiroin
やれるもんならやってみてよ～[p]
君が全部的中しているところ見たことないけど～？[p]

#
くそ……。[p]

;シーン転換・ゲームスタート
;驚かしはなし……かも　皆中しているときの4発目に何かのイベントを作ろうかな

;勝ったとき
#
っしゃあ！！！[p]
見てたか！hiroin！！[p]

#hiroin
そんなぁ……[r]
絶対勝ったと思ってたのに……。[p]

#
それじゃあアイスはお前のおごりな[p]

#hiroin
......。[p]
ぅわ～ん……。[r]
ore君に脅されてるよぉ～……。[p]

#女子弓道部員A
ore君？またhiroinちゃんを泣かせてるの？[r][l]
hiroinちゃんが可哀そうだよー。[p]

#
ちょっと！？泣かせてはないよ！？[p]
っていうか全部的中したことを褒めてくれてもいいじゃないの！？[p]

;引き分け
#
引き分けかぁ……

#ひ
これじゃあ勝負つかないじゃん……。
もう勝ち負け関係なくアイス奢ってよ！

#
はぁ？それは約束が違うだろ！
引き分けならアイスを義務は無いだろ。

#ひ
うーん……。
じゃあさ、私がアイス奢るからoreのアイス奢って？

#
？
どういうことだよ……？

#ひ
引き分けたってことは、両方が勝って、両方が負けたってことでしょ？
だったらこれでいいんじゃない？

#
なんでそんな無駄なことを……？
自分でアイスを買えばいいだけだろ。

#ひ
やだ！奢ってもらうことが大事なの！

#
分かったよ……。
部活終わったらコンビニ行くぞ。

#ひ
はーい♪

#
(なんなんだコイツ……)

;負け
#
ま、負けてしまった……。

#ひ
イェーイ！私の勝ち〜！
ちゃんとアイス奢ってね〜。

#
くそっ……。

#ひ
どんなアイスにするか楽しみだな〜。
高いやつにしちゃおうかな〜。

#
……。
…帰りにそこのコンビニでアイス奢ってやるから、
着替えたら待っとけよ…。

#ひ
！
わーい！oreがアイス奢ってくれるって〜。

#女子部員A
え〜いいな〜。私の分も奢ってよ〜。

#
さすがに一人が限界だ……。勘弁してくれ……。

;----コンビニに移動----
[label name="s4-konbini"]
;勝ち
#hiroin
も～勝てると思ってたのに～[p]
くやしいくやしいくやしいくやしい～～～～～[p]

#
残念だったな。ははっ。[p]
約束だぞ。アイスを奢ってもらおう。[p]

#hiroin
も～～～。[r]
oreくんのケチ！！[p]

#
うるさいなぁー。[r][l]
さっさとこのアイスを買ってくれ。[p]

#hiroin
oreくんさあ……。こんなかわいい幼馴染に奢らせるとかありえないんだけど～～。[p]
これは借りだからね～～。[p]

;現金決済

#
勝負だったのになんで借りになるんだよ。[p]
言っとくけど、借りだったとしても返すつもりはないからな[p]

#hiroin
ふーん。まあいいや。[p]
せっかくだし近くの公園で食べようよ！[p]

#
そうだな。[r]
公園まで行こうか。[p]

;引き分け
#ひ
どのアイスにしようかな〜。

#
言っとくけど、あまり高いやつにするなよ。
今月かなり厳しいんだ。

#ひ
わかってるよ〜。
oreは決まったー？

#
これにしようかな。
もう決まったのか？

#ひ
うーん……。
じゃあこれ！

#
決まったな。レジ行くぞ。

;現金決済×2
#
(あぶねーあとちょっとしかお金が残ってないし……)

#ひ
ん？どうしたの？

#
いや、なんでもない。
アイスは近くの公園で食べようか。

#ひ
わかった！行こう！

;負け
#ひ
うーん、どのアイスにしようかなぁ〜。

#
(頼む、できるだけ安いやつにしてくれ……!)

#ひ
この期間限定のやつが気になるなぁ〜。
誰か奢ってくれる優しい人はいないかな〜。

#
…アイスは決まったか？

#ひ
えっ！もしかして奢ってくれるの！？
ありがと〜！

#
元々そう言う約束だっただろ……。
レジに持ってくから渡せ。

#ひ
はい、どーぞ。
oreって優しいんだねー。

#
(何を考えているんだコイツは……)
;現金決済

#
アイスも買えたし近くの公園で食べるぞ。

#ひ
はーい。

;----公園に移動----
[label name="s5-park"]

#
この辺でアイス食べるか。[p]

#hiroin
ちょっとトイレに行きたいからアイス持ってて。[p]

#
先に食べてるぞー。[p]
（なにか思うところがある）[p]

（いろいろ考えている途中）[p]
;テキストが進んでいる途中でhiroinがいきなり飛び出てくる

#
うわああああああ！！！！！[p]

#hiroin
あははははっ。[r]
ore君いつも油断しすぎだよ～。[p]

#
アイス食ってるときに人を驚かせるな！！[p]

#hiroin
ごめんごめん。ore君が何かに集中しているところを見ると[r]
ついイタズラしたくなっちゃうんだよ～。[p]

#
このっ……。[p]
アイスが服についちゃったじゃねえかよ……。[p]

#hiroin
（……。ピコーン！）[p] ;これはoreに近づくチャンスだと思っている
あっほんとだ！[r]
ごめんね、拭いてあげるね～。[p]

#
（ポケットティッシュを取り出してごしごししようとする。）[p]

#
別にこれくらい自分でやるよ。[p]

#hiroin
ダメ！これはわたしの仕事なの！[r]
oreくんは座って待ってて！[p]
（ごしごし。ごしごし……。）[p]

#
（なんでコイツはこんなに怒ってるんだ……？）[p]
（それにしても近いな……。）[p]

#hiroin
……。;めっちゃ小さい文字で「スンスン。」と服の匂いを嗅ぐ
よし、これでいいでしょ！[p]

#
まあちょっとシミは残ってるけどな……。[r]
やらないよりマシか……。[p]

#hiroin
はい、わたしのアイス返してー。[p]

#
かなり溶けてると思うぞ。[r][l]
買いなおした方がいいんじゃないか？[p]


#hiroin
別にいーよ。[r]
ほとんどわたしが悪いし。[p]

#
それもそうか。[r][l]
じゃあこのまま食べるか。[p]

;背景変化 エモいスチル
;セミの声など公園っぽい環境音＆BGMに
;この後の驚かしポイントは袋破裂による爆音とか？

#hiroin
やっぱり夏に公園でアイスを食べるのっていいよねー。[p]

#
そうだなー。「青春」をしてる感じがするな。[p]

;エモい雑談パート
;爆音

#hiroin
あれ？ちょっと待って。[p]
（かばんの中を探し出す。）[p]

#
どうした？忘れ物か？[p]

#hiroin
……。[l]…………。[l]………………。[l]
弁当箱がない……。[p]

#
えっ！？[l][r];衝撃による振動
こんな暑い日に学校に置きっぱなしにしたら確実に腐っちゃうじゃん！[p]

#hiroin
そうだよ……。どうしよう……。[p]

#
俺も一緒に行くから学校まで戻ろう。まだ18時だしギリギリ空いてるはずだよ！[p]

#hiroin
……。よし戻ろう！[p]

;全力ダッシュ 場面転換
;----学校に移動----
[label name="s6-lookfor"]
#
どこに置いてきたか覚えてるか？[p]

#hiroin
分かんない！教室か弓道場だと思う！[p]

#
じゃあ二手に分かれよう！[l][r]
俺は教室に行くよ。[p]

#hiroin
分かった。わたしは弓道場を見てくる！[p]

;たぶん教室に移動
#
あいつのクラスは確かこっちだったはず……。[p]
席はどこだ……？[p]
あった！これがあいつの弁当箱だろ。[p]
よし、見つけたし弓道場まで行って帰るか。[p]
;謎のチャイムが鳴る
#
……。[p]
そういえばすでに暗い時間だな……。[p]
ちょっと外も暗くて怖い気がしてきた……。[p]
いや、大丈夫だ。こんな学校で何か起こることなんて絶対にないからな。[p]

;あまりホラー感のない歩くだけの場面
;必要かな……。
;すこししたところでsubちゃんがいきなり登場
#sub
わ～[p]

#
わあああああぁぁああぁぁぁあぁあああぁぁ！？！？！？[p]

#sub
あははっ。ore君がビビりだって噂、ほんとうだったんだねー。[p]

#
もー……。あまりビックリさせないでくれ……。[p]

[s]
