;ティラノスクリプトサンプルゲーム

*start

[cm  ]
[clearfix]
[start_keyconfig]


[bg storage="room.jpg" time="100"]

;メニューボタンの表示
@showmenubutton

;メッセージウィンドウの設定
[position layer="message0" left=160 top=500 width=1000 height=200 page=fore visible=true]

;文字が表示される領域を調整
[position layer=message0 page=fore margint="45" marginl="50" marginr="70" marginb="60"]


;メッセージウィンドウの表示
@layopt layer=message0 visible=true

;キャラクターの名前が表示される文字領域
[ptext name="chara_name_area" layer="message0" color="white" size=28 bold=true x=180 y=510]

;上記で定義した領域がキャラクターの名前表示であることを宣言（これがないと#の部分でエラーになります）
[chara_config ptext="chara_name_area"]

;このゲームで登場するキャラクターを宣言
;akane
[chara_new  name="akane" storage="chara/akane/normal.png" jname="あかね"  ]
;キャラクターの表情登録
[chara_face name="akane" face="angry" storage="chara/akane/angry.png"]
[chara_face name="akane" face="doki" storage="chara/akane/doki.png"]
[chara_face name="akane" face="happy" storage="chara/akane/happy.png"]
[chara_face name="akane" face="sad" storage="chara/akane/sad.png"]

;hiroin 

;sub

;教室
[label name="s1-classroom"]
;[button text="s2-図書館" target="s2-library"]
[skipstart]

#
俺はore。ごく普通の男子高校生だ。[p]
成績も普通。スポーツも普通。他の人と比べて特に目立つようなところはない。[r][p]
ある一点を除いて……。[r]それは……。[p]

#？？？
お～い？[r]oreく～ん？[p]

#
？[p]

;廊下に向く
#？？？
どうも～[r]
元気～？[p]

#
やあ、subちゃん。俺は元気だよ。[r][p]
あれ？今日はhiroinは学校に来てないの？[p]

#sub
あ～それがね～。[p]

;hiroinが下から勢いよく登場
#hiroin
[font size="60"]わっ！！！！[p][resetfont]

#
おわ！？！？！？！？

[quake time=300 vmax=0 hmax=10 count=4]

[p]

#hiroin
えへへ～[r][p]
びっくりした～？[p]

#
そりゃいきなり現れたらびっくりするよ……。[p]

#sub
ごめんねー。hiroinちゃんに頼まれてore君を驚かす手伝いをしてほしいって言われてさ～[p]

#hiroin
え～subちゃんもノリノリだったじゃ～ん。[p]

#
くっそ……[p]
(ご覧の通り俺は超絶のビビりなのである。)[r][p]
(しかも、幼馴染のhiroinは俺がビビりなことをからかって毎日驚かしに来るのである。)[p]
(おかげで驚かされる度にクラスメイトから注目されてしまう……。)[p]

#
いつも驚かせに来るけど、そろそろやめてくれない……？[r][p]

#hiroin
えー？やめてって言われても、oreの反応が面白いもーん。[p]
絶対やめな～い。[p]

#sub
あはは……。[r]それじゃあ私は委員会の仕事があるからまた明日ね。[p]

#hiroin
バイバイsubちゃん！[p]

#
バイバイ。[p]

#hiroin
ore君はこの後どうする？[r]このまま部室に来る？[p]

#
いや、図書館に本を返しに行ってから部活に行こうかな。[p]

#hiroin
そう？じゃあ私も付いていこうかな。[p]

#
じゃあ図書館に行くか。[p]

[skipstop]

;----scene1終了-----
;図書館へシーン遷移
[label name="s2-library"]


#hiroin
そういえば何の本を借りてたの？[p]

#
気になった小説とかかな。[p]
付いてきたのはいいけど、図書館だから流石に静かにしろよ。[p]

#hiroin
そんぐらい分かってるよぅ～[l][r]
なるべく早く終わらせてー。[p]

#
すぐ終わらせるから待ってて。[p]

#hiroin
はーい。

#
(絶対驚かしに来るんだような……)

;図書館内に移動
#
借りてた本を返す前に次に借りる本を探すか。[p]
どの本を借りようかな……[p]

;本を選ぶイベント発生 今週のおすすめの本のコーナーにて
;話題の人気小説1,2(どっちかがsubのおすすめ)・推理系・エッセイ・難しそうな本・謎の本

;選択後
この本にするか。[p]

;受付前に移動
#sub
あっore君。今日も本を借りに来たの？[p]

#
そうだよ。先に前に借りた本を返してからだけどね。[p]

#sub
じゃあ返却ってことだねー。[r][l]
こ・れ・で・よし。[l] ;テキストスピードを落とす
返却できたよー。[p]

#
ありがとう。[r]
じゃあこれが借りる本ね[p]

;借りた本による分岐・例１
#sub
さんきゅー。
ってこれ私のおすすめの本じゃん！[p]

#
えっこの本ってsubちゃんがおすすめしてた本だったの？[p]

#sub
そーだよ。[r]
かなりいい本だから、返すときに感想聞かせてね。[p]

#
分かったよ。じゃあ部活行ってくる。[p]

#sub
部活がんばってねー。[p]

;廊下
#hiroin
ちょっとー遅いよー[r][l]
ケッコー待ってたんだけど～。[p]

#
ごめん。ちょっと借りる本に迷っちゃって。[p]

#hiroin
すぐ部活に行こう！[l][r]
部室まで競争だ！！[p]

#
あっ！ちょっとスタートダッシュずるい！[p]

;場面変更
;----シーン２終了----
[label name="s3-club"]

;昇降口

#
はぁはぁ……。[l][r]
本をカバンにしまってたら完全に置いてかれてしまった……。[p]

#hiroin ;横から登場
[font size="60"]わっ！！！！[p][resetfont]

#
うぇっっっっっ！？！？！？[p]

#hiroin
あはははははっあはははっはっ[r]
やっぱりoreの反応おもしろい～～～。[p]

#
このやろぉ……。[r]
俺をダッシュで置いていったのは驚かすためだったのか……。[p]

#hiroin
ほんとーはそんな気はなかったたんだけど、思いついちゃったんだよね～。[p]

#
こいつ……。[p]

#hiroin
ちなみにレースはまだ終わってないよ～。[p]
;hiorinがダッシュで逃げる

#
あっ！ちょっと待て！！[p]

;弓道場に移動、弓道着に着替えて登場
#hiroin
わたしの勝ち～。[l][r]
ore君、遅かったね～。[p]

#
お前が「驚かす」っていう卑怯な手を使ってくるからだろ……。[p]

#hiroin
途中で物陰から現れただけだし～。[p]

#
それが卑怯っていうんだろ……。[r][l]
とにかく今回のレースに関してはノーカンでしょ！[p]

#hiroin
え～～～[r][l]
じゃあ的中率で勝負しようよ！！[p]
わたし、今日の朝練ですっごく調子よかったんだよね～。[p]

#
的中率の勝負なら望むところだ！[r]
卑怯な手は絶対使うなよ？[p]

#hiroin
負けたほうがコンビニでアイスおごるってことで良いよね！[p]
真剣勝負だ！！[r]
絶対負けないからね！！[p]

;----一時暗転----
#hiroin
3発！3発も当たったよ！！[r][l]

#
見てたから知ってるよ……。[p]

#hiroin
メチャクチャ上手くいったよ！[r][l]
これで君は全部的中させなきゃ勝てないね～。(ニヤニヤ)[p]

#
これはかなり勝つのが厳しいな……。[p]
全部当ててやるからな！[l]見とけよ！！[p]

#hiroin
やれるもんならやってみてよ～[p]
君が全部的中しているところ見たことないけど～？[p]

#
くそ……。[p]

;シーン転換・ゲームスタート
;驚かしはなし……かも　皆中しているときの4発目に何かのイベントを作ろうかな

;勝ったとき
#
っしゃあ！！！[p]
見てたか！hiroin！！[p]

#hiroin
そんなぁ……[r]
絶対勝ったと思ってたのに……。[p]

#
それじゃあアイスはお前のおごりな[p]

#hiroin
......。[p]
ぅわ～ん……。[r]
ore君に脅されてるよぉ～[p]

#女子弓道部員A
ore君？またhiroinちゃんを泣かせてるの？[r][l]
hiroinちゃんが可哀そうだよー。[p]

#
ちょっと！？泣かせてはないよ！？[p]
っていうか全部的中したことを褒めてくれてもいいじゃないの！？[p]

;引き分け・負け

;----コンビニに移動----
[label name="s4-konbini"]

#hiroin
も～勝てると思ってたのに～[p]



[s]